[
  {
    "model": "collection.collection",
    "pk": 21,
    "fields": {
      "name_jp": "豊前住河野貞光国光作",
      "name_en": "Made by Kono Sadamitsu, a resident of Buzen",
      "provider": "E-Sword",
      "signature": "豊前住河野貞光国光作 庚辰年四月日 八幡大菩薩",
      "type": "katana",
      "blade_length": "76.00",
      "curvature": "1.70",
      "sword_weight": "663.00",
      "motohaba": "3.21",
      "sakihaba": "2.40",
      "motogasane": "0.62",
      "sakigasane": "0.47",
      "period_type": "gendaito",
      "period": "Heisei",
      "koshirae": "Vermilion lacquered scabbard with katana mounting",
      "registration": "Kumamoto No. 52289 August 19, 2005",
      "certificate": "Japan Art Sword Preservation Association Preserved Sword Appraisal Report May 28, 2020",
      "remarks": "Swordsmith Kono Sadamitsu's real name is Kono Hiroshi. Born in 1950, he lives in Shimohonjo, Saigawa-cho, Kyoto Town, Fukuoka Prefecture.\r\nHe initially learned swordmaking from his father, the first Kunimitsu swordsmith (Hidarikunitsu) (Kono Kunimitsu, resident of Buzen), which is why swordsmith Sadamitsu was initially called (Hidarikunitsu II).\r\nLater, in 1975, he became an apprentice to the late Living National Treasure swordsmith Gassan Teiichi, where he trained in swordmaking and blade carving.\r\nIn recognition of his high level of skill, the late Gassan Teiichi bestowed the character \"Sada\" on him, and he has since taken the name \"Sadamitsu.\"\r\nA dedicated swordsmith, he pursues the true function and functional beauty of the Japanese sword, which is to cut well without breaking or bending. He is known for his cutting ability, and is considered one of the best of modern swordsmiths, earning him the nickname \"Ima Toratetsu,\" among others. His works are renowned for their beauty and sharpness, and are highly regarded by martial artists.\r\nHis popularity has increased even more since the death of swordsmith Sadamitsu.\r\nHe has received numerous awards, including the Effort Award at the New Famous Sword Exhibition.\r\n*Although this work is technically a collaborative work with his father, swordsmith Kunimitsu, it is in fact the work of swordsmith Sadamitsu.",
      "price": "1200000.00",
      "currency": "JPY",
      "created_at": "2025-11-01T16:15:13.292Z",
      "updated_at": "2025-11-04T01:28:26.097Z"
    }
  },
  {
    "model": "collection.collection",
    "pk": 20,
    "fields": {
      "name_jp": "長州住二王直清作（二代）",
      "name_en": "Choshu ju Nio Naokiyo（2nd Gen）",
      "provider": "刀心",
      "signature": "長州住二王直清作",
      "type": "katana",
      "blade_length": "72.66",
      "curvature": "1.17",
      "sword_weight": "1008.00",
      "motohaba": "3.49",
      "sakihaba": "2.56",
      "motogasane": "0.84",
      "sakigasane": "0.68",
      "period_type": "shinto",
      "period": "Edo Genji",
      "koshirae": "Shirasaya",
      "registration": "Registered by Hiroshima Prefecture on July 14, 1966",
      "certificate": "Special Preservation Sword Appraisal Certificate",
      "remarks": "This sword bears the signature of Kiyoshige, a Choshu clan craftsman active in Nagato Province (Yamaguchi Prefecture) during the late Edo period. Naokiyo, whose secular name was Tamai Chozo, was a descendant of the Niou school and studied under Daikei Naotane.\r\n\r\nThis sword has a shallow curvature, a moderate gap between the tip and base, a long and powerful blade, and a finely forged jigane with densely kneaded ko-itame-hada (small itame grain) finish. The finely detailed jikei (ground ridges) and thick ji-ke (ground ridges) reveal the delicate jikei (ground ridges) and are reminiscent of the ko-nukahada (rice bran-like) texture of a Hizen sword. The hamon (blade pattern) is a bright and clear nioiguchi (sweet beaded blade) with a jino-me-irregular pattern, interspersed with slightly taller jino-me (ground ridges) and raised knots in places. The blade is frequently pierced with fine sand-flowing patterns, the jino-me (ground ridges) are overflowing with spits, and the blade curls easily on both the front and back. With no notable flaws or imperfections, this is a masterpiece that demonstrates Naokiyo's mastery of the craftsmanship.",
      "price": "1100000.00",
      "currency": "JPY",
      "created_at": "2025-11-01T16:09:28.639Z",
      "updated_at": "2025-11-04T01:28:40.116Z"
    }
  },
  {
    "model": "collection.collection",
    "pk": 19,
    "fields": {
      "name_jp": "則重 光遜",
      "name_en": "Mitsunori Norishige",
      "provider": "「刀の蔵」",
      "signature": "（金粉銘）則重 （金粉銘）光遜（花押）",
      "type": "wakizashi",
      "blade_length": "52.90",
      "curvature": "0.90",
      "sword_weight": "472.00",
      "motohaba": "273.00",
      "sakihaba": "1.96",
      "motogasane": "0.51",
      "sakigasane": "44.00",
      "period_type": "koto",
      "period": "Late Kamakura",
      "koshirae": "Shirasaya",
      "registration": "Aichi Prefecture registration: Issued on February 12, 2008",
      "certificate": "Specially preserved swords",
      "remarks": "Since ancient times, Norishige has been cited as one of the Ten Great Masters of Masamune, but given the shape of his tachi and tanto, and the dates of production from Masakazu and Gen'o, it seems appropriate to accept the theory stated in a Muromachi period sword book that he was a pupil of Shindogo Kunimitsu, and that he should be considered a fellow pupil of Masamune. Norishige's style often expresses variations in the nigiri more than Masamune, and his forging is characterized by an even larger scale of texture, revealing the unique texture known as pine bark skin, which is unique to master craftsmen.\r\nThis wakizashi has a mixture of large itame and moku, and the texture has a large scale of texture resembling pine bark skin, with good ji nigiri and jikage. The blade pattern is based on a curved blade with a mixture of gunome, small irregularities and small gunome, with ashiiri, deep nioi and thick yaki, coarse yaki mixed in, frequent sunagashi and gold lines and yaki lines throughout, making this a masterpiece that beautifully expresses the characteristics of the craftsmanship of the artisan.",
      "price": "1900000.00",
      "currency": "JPY",
      "created_at": "2025-11-01T16:03:53.841Z",
      "updated_at": "2025-11-04T01:29:03.359Z"
    }
  },
  {
    "model": "collection.collection",
    "pk": 18,
    "fields": {
      "name_jp": "粟田口源広網作",
      "name_en": "Awataguchi Genhiro Net Works",
      "provider": "E-Sword",
      "signature": "粟田口源広網作 以南蛮鉄造之",
      "type": "katana",
      "blade_length": "62.50",
      "curvature": "1.80",
      "sword_weight": "565.00",
      "motohaba": "3.17",
      "sakihaba": "2.14",
      "motogasane": "0.65",
      "sakigasane": "0.44",
      "period_type": "shinto",
      "period": "Edo ENPO",
      "koshirae": "Black lacquered scabbard with katana mounting",
      "registration": "Kochi No. 22353 July 3, 1973",
      "certificate": "Japan Art Sword Preservation Association Specially Preserved Sword Appraisal Certificate May 28, 202",
      "remarks": "He was a blacksmith from Ishido, Kishu, and became a pupil of the first Tadatsuna.\r\nOne theory is that he was a pupil or a member of the same clan as Tunbo Nagatsuna.\r\nHe also lived in Kii, Aki Province.\r\nHis works include \"Awataguchi Deaf Hiroami,\" \"Awataguchi Asai Gen Hiroami,\" and \"Kii Province Hirotsuna.\"",
      "price": "600000.00",
      "currency": "JPY",
      "created_at": "2025-11-01T15:59:21.157Z",
      "updated_at": "2025-11-04T01:29:22.161Z"
    }
  },
  {
    "model": "collection.collection",
    "pk": 17,
    "fields": {
      "name_jp": "山城守藤原國清",
      "name_en": "Yamashiro no kami Fujiwara Kunikiyo（1st Gen）",
      "provider": "刀心",
      "signature": "山城守藤原國清　鍛南蠻鐵釼之（菊紋）",
      "type": "katana",
      "blade_length": "75.40",
      "curvature": "1.20",
      "sword_weight": "817.00",
      "motohaba": "3.21",
      "sakihaba": "2.55",
      "motogasane": "0.77",
      "sakigasane": "0.56",
      "period_type": "shinto",
      "period": "Early Edo",
      "koshirae": "Shirasaya",
      "registration": "Registered in Tokyo on March 22, 1951",
      "certificate": "Special Preservation Sword Appraisal Certificate, Special Valuable Sword Certification Certificate",
      "remarks": "The first Yamashiro no Kami Kunikiyo, a swordsmith employed by Matsudaira Tadamasa, was named Kichiemon and was born in Matsumoto, Shinshu, as the son of the third Shimada Sukemune.\r\nHis initial signature was Sukemune. He later traveled to Kyoto and became a disciple of Horikawa Kunihiro, changing his signature to Kunikiyo. After his master Kunihiro's death, he served Matsudaira Tadamasa in Takada, Echigo, and is said to have followed his lord to Fukui, Echizen, when Tadamasa was transferred there. In 1626, he received the title of Yamashiro Daijo. He was permitted to carve the chrysanthemum crest, and the following year he became Yamashiro no Kami. He died in 1655 at the age of 60. The Kunikiyo signature has been passed down through several generations, but the first was particularly skilled and highly ranked. The second Kunikiyo was the son of the first, and like the first, many of his swords have straight blades, some of which display a style reminiscent of Hizen swords. Furthermore, the character \"ichi\" (one) is generally not used on swords made by the first, while the character \"ichi\" is found on swords made by the second and subsequent generations.",
      "price": "3850000.00",
      "currency": "JPY",
      "created_at": "2025-11-01T15:45:40.613Z",
      "updated_at": "2025-11-04T01:29:47.699Z"
    }
  },
  {
    "model": "collection.collection",
    "pk": 16,
    "fields": {
      "name_jp": "無銘　兼長",
      "name_en": "Unsigned Kanenaga",
      "provider": "「刀の蔵」",
      "signature": "無銘　兼長",
      "type": "wakizashi",
      "blade_length": "54.60",
      "curvature": "1.20",
      "sword_weight": "470.00",
      "motohaba": "3.10",
      "sakihaba": "2.70",
      "motogasane": "0.69",
      "sakigasane": "0.58",
      "period_type": "koto",
      "period": "Nanboku-chō",
      "koshirae": "Black lacquered wakizashi scabbard",
      "registration": "Tochigi Prefecture registration: Issued on May 18, 1989",
      "certificate": "Important Swords",
      "remarks": "Kanenaga was a pupil of Bizen Nagayoshi, and although there are very few of his signature works remaining, one of his works is a wakizashi from the 5th year of the Jōji era, designated an Important Art Object, which shows a pattern in the Minayaki style. Other tantō swords that remain are from the 4th year of the Shitoku era, designated an Important Sword, and the 2nd year of the Kakei era, designated a Specially Important Sword. These swords have strong nigiri and ample jiba work, and are noteworthy for their workmanship, which, while similar to Nagayoshi's style, shows an even greater emphasis on the Sagami tradition.\r\nThis work has koitame forging with fine jinige and jikage. The hamon is mainly koshiharai with gunome, mixed with tsuba and choji, and has toyaki-kari, good ashi and ha, small nigiri, and sunagare-kari.",
      "price": "3200000.00",
      "currency": "JPY",
      "created_at": "2025-11-01T15:41:08.166Z",
      "updated_at": "2025-11-04T01:30:26.498Z"
    }
  },
  {
    "model": "collection.collection",
    "pk": 15,
    "fields": {
      "name_jp": "武州江戸越前康継",
      "name_en": "Bushu Edo Echizen Yasutsugu",
      "provider": "E-Sword",
      "signature": "武州江戸越前康継",
      "type": "katana",
      "blade_length": "64.60",
      "curvature": "0.80",
      "sword_weight": "522.00",
      "motohaba": "2.84",
      "sakihaba": "1.86",
      "motogasane": "0.55",
      "sakigasane": "0.38",
      "period_type": "shinto",
      "period": "Edo Keian",
      "koshirae": "Black lacquered scabbard with katana mounting",
      "registration": "Fukuoka No. 39646 August 16, 1962",
      "certificate": "Japan Art Sword Preservation Association Special Preservation Sword Appraisal Certificate January 16",
      "remarks": "The first Yasutsugu was from Shimosaka, Sakata County, Omi Province (Shiga Prefecture), and moved to Fukui in Echizen, where he became a hired blacksmith for the Matsudaira family.\r\nAround 1608, he was summoned to Edo by Tokugawa Ieyasu, where he forged swords and was given the character \"yasu\" (lowercase) and changed his name to Yasutsugu.\r\nFrom then on, they became hired blacksmiths for the Tokugawa Shogunate, and the Yasutsugu name continued for generations until the end of the Edo period.\r\nThe first and second generations specialized in the Sagami style of swords with strong embossing.\r\nFrom the third generation onwards, the family split into two branches, one in Edo and the other in Echizen.\r\nIn Edo, the family continued for 12 generations after succeeding the third generation, and in Echizen, the name \"Shiroemon\" became the third generation in Echizen, a tradition that has continued for 9 generations.",
      "price": "1300000.00",
      "currency": "JPY",
      "created_at": "2025-11-01T15:36:17.250Z",
      "updated_at": "2025-11-04T01:30:52.688Z"
    }
  },
  {
    "model": "collection.collection",
    "pk": 14,
    "fields": {
      "name_jp": "立子山住人将平作",
      "name_en": "Written by Shohei, a resident of Tateshiyama",
      "provider": "刀心",
      "signature": "立子山住人将平作（花押）",
      "type": "tachi",
      "blade_length": "90.89",
      "curvature": "3.31",
      "sword_weight": "1080.00",
      "motohaba": "3.50",
      "sakihaba": "2.72",
      "motogasane": "0.84",
      "sakigasane": "0.64",
      "period_type": "gendaito",
      "period": "Heisei",
      "koshirae": "Copper base with gold plating on the sword",
      "registration": "February 7, 2018 Registered in Fukushima Prefecture",
      "certificate": null,
      "remarks": "Swordsmith Fujiyasu Shohei was born in Date County, Fukushima Prefecture in 1946. In 1966, he became an apprentice to the late Living National Treasure, Miyairi Yukihira, a swordsmith from Sakaki Town, Nagano Prefecture.\r\n\r\nIn 1975, he opened his own swordsmithing workshop in Tachikoyama, Fukushima Prefecture, and went independent. Since then, he has continued to study and practice sword making, receiving the Japan Art Sword Preservation Association's Excellence Award three times, the Encouragement Award six times, and the Effort Award seven times. In 1990, he received the Japan Art Sword Preservation Association's Chairman's Award, and in 2002, he received the Japan Art Sword Preservation Association's Kanzan Award.\r\n\r\nHe has performed dedication forgings at many shrines, including Owari Atsuta Shrine and Nara Gokoku Shrine, and in 2008, he performed a dedication forging of a Japanese sword at Hitachi Kashima Shrine, the first time in approximately 1,300 years since the sword was made by Sabinomaro in 704.\r\n\r\nIn the autumn of 1984, he was tasked with the important task of crafting a sacred sword for the 61st Shikinen Sengu (yearly reconstruction) of Ise Grand Shrine, and has also made significant contributions to the reconstruction of the Mikatana Shrine in Minamisoma, Fukushima Prefecture, which was severely damaged in the recent earthquake, crafting a straight sword that will become a sacred treasure.Most recently, he has been involved in the restoration and forging of a large straight sword excavated from the Miyajidake Kofun Tumulus in Fukuoka, making him one of the most skilled swordsmiths in modern Japan.",
      "price": "5500000.00",
      "currency": "JPY",
      "created_at": "2025-11-01T15:30:25.852Z",
      "updated_at": "2025-11-04T01:31:30.651Z"
    }
  },
  {
    "model": "collection.collection",
    "pk": 13,
    "fields": {
      "name_jp": "彫同作 龍貞次",
      "name_en": "Carved by Teiji Ryu",
      "provider": "「刀の蔵」",
      "signature": "彫同作 龍貞次（花押）",
      "type": "tanto",
      "blade_length": "27.80",
      "curvature": "0.00",
      "sword_weight": "266.00",
      "motohaba": "3.16",
      "sakihaba": "2.59",
      "motogasane": "0.76",
      "sakigasane": "0.61",
      "period_type": "gendaito",
      "period": "Showa",
      "koshirae": "Shirasaya",
      "registration": "Registered in Ehime Prefecture: October 10, 1955",
      "certificate": "Special Preservation Sword Appraisal Certificate",
      "remarks": "Swordsmith Takahashi Sadatsugu was born in 1899 in Omachi Village, Arai County (present-day Saijo City).\r\nHis real name was Kaneichi. At the age of 15, he apprenticed under Osaka master swordsmiths Gassan Teiichi and his son Sadakatsu, and in 1919 he was hired as a trainee at the Central Sword Association in Tokyo, where he thereafter devoted himself to the study of ancient swords.\r\nIn 1936, he opened a sword forge in Ishite, Matsuyama City, and, taking the name Ryuoji Sadatsugu, honed his skills in blade carving. In 1955, he became the first swordsmith to be recognized as a Holder of an Important Intangible Cultural Property (Living National Treasure), and he carefully crafted amulets for the births of Prince Hiro and Prince Aya.",
      "price": "3300000.00",
      "currency": "JPY",
      "created_at": "2025-11-01T15:25:50.324Z",
      "updated_at": "2025-11-04T01:31:57.715Z"
    }
  },
  {
    "model": "collection.collection",
    "pk": 12,
    "fields": {
      "name_jp": "武州住石堂秦守久",
      "name_en": "Bushu Ju Ishido Hata Morihisa",
      "provider": "E-Sword",
      "signature": "武州住石堂秦守久",
      "type": "katana",
      "blade_length": "73.50",
      "curvature": "2.10",
      "sword_weight": "632.00",
      "motohaba": "3.23",
      "sakihaba": "2.25",
      "motogasane": "0.67",
      "sakigasane": "0.41",
      "period_type": "shinto",
      "period": "Early Edo",
      "koshirae": "Black and vermilion spiral pattern lacquered scabbard with katana mounting",
      "registration": "Miyazaki No. 28194 June 27, 1983",
      "certificate": "Japan Art Sword Preservation Association Specially Preserved Sword Appraisal Certificate May 28, 202",
      "remarks": "He was a member of the Edo Ishido school and his name was Ishido Yazaemon. His home province was Mino, and he later changed his name to Toren.\r\nHe is said to have lived in Edo Toshima and Konosu in Bushu.\r\nHis pen names include \"Morikazuchi Hata, resident of Bushu,\" \"Ishido Hata Morihisa, resident of Bushu,\" \"Ishido Hata Morihisa, resident of Edo, Toshima County, Bushu,\" and \"Ishido Hata Toren.\"\r\nHe is also famous as a creator of Edo Ishido masterpieces.",
      "price": "750000.00",
      "currency": "JPY",
      "created_at": "2025-11-01T14:48:26.607Z",
      "updated_at": "2025-11-04T01:32:15.791Z"
    }
  },
  {
    "model": "collection.collection",
    "pk": 11,
    "fields": {
      "name_jp": "秀真（伝古備前）",
      "name_en": "Hidemasa (traditionally from Kobizen)",
      "provider": "刀心",
      "signature": "秀真",
      "type": "katana",
      "blade_length": "71.10",
      "curvature": "1.60",
      "sword_weight": "694.00",
      "motohaba": "2.75",
      "sakihaba": "2.19",
      "motogasane": "0.60",
      "sakigasane": "0.50",
      "period_type": "koto",
      "period": "Middle Kamakura",
      "koshirae": "Shirasaya",
      "registration": "Registered in Saga Prefecture on March 20, 2002",
      "certificate": "Special Preservation Sword Appraisal Certificate",
      "remarks": "Ko-Bizen is the general term for a school of swordsmiths that emerged in the mid-Heian period in Bizen Province, where high-quality iron sand was produced, and surviving works date from the late Heian period to the mid-Kamakura period.\r\nHidezane was a swordsmith of the Ko-Bizen school mentioned above, and was active around the Kencho period in the mid-Kamakura period, close to the early Kamakura period.\r\nThis sword is heavily polished, but to avoid losing its signature, it has been left with a forehead inscription, and the sword has a design that evokes its time, with no discernible difference in width between the base and tip, which is common in heavily polished swords. The jigane has well-forged koitame grain with a mixture of mokume and jikege, and a pronounced shine near the blade, the hamon has a bright nioiguchi pattern, the front of the blade is curved with a mixture of tate-nome and ko-ranore, the back of the blade has noticeable small tate-nome and ko-choji irregularities, the middle of the blade is heavily textured with fine sanda-ryu and kinsuji, and it boasts an elegant finish, and the nip on both the front and back is straight with a slightly irregular texture and a rounded turn.\r\nThe fluent scabbard inscription by Tanobe Tanzan is one of the highlights of this sword, and as he notes, it is also very interesting that the character \"shin\" is similar to the old one-character jinri, making this a masterpiece with great documentary value.",
      "price": "4015000.00",
      "currency": "JPY",
      "created_at": "2025-11-01T14:43:26.596Z",
      "updated_at": "2025-11-04T01:32:36.750Z"
    }
  },
  {
    "model": "collection.collection",
    "pk": 10,
    "fields": {
      "name_jp": "肥前国住近江大掾藤原忠広",
      "name_en": "Fujiwara Tadahiro, a resident of Hizen Province and head of the Omi Daijo",
      "provider": "「刀の蔵」",
      "signature": "肥前国住近江大掾藤原忠広",
      "type": "katana",
      "blade_length": "70.70",
      "curvature": "2.10",
      "sword_weight": "611.00",
      "motohaba": "3.12",
      "sakihaba": "2.20",
      "motogasane": "0.68",
      "sakigasane": "0.57",
      "period_type": "shinto",
      "period": "Early Edo",
      "koshirae": "Shirasaya",
      "registration": "Registered in Kagawa Prefecture: Issued on April 21, 2005",
      "certificate": "Specially preserved swords",
      "remarks": "Omi Daijo Tadahiro was the son of the first Tadayoshi, and was only 19 years old when his father passed away in 1639, but he has been making swords since then. This is due not only to the fact that he naturally possessed the talent and skill to be a swordsmith, but also to the cooperation and support of the first Tadayoshi's apprentices. From receiving the title of Omi Daijo in July 1635 until his death at the age of 81 in 1693, he had a sword-making career spanning over 60 years, making him the most prolific of all Hizen swordsmiths.\r\nThis sword has a densely forged Ko-Itame-Hada with finely divided Jinuke (ground ridges), a rice bran-like texture, and fine Jike (ground ridges). The hamon is based on a medium straight blade, with a shallow curve, a good foot, deep Nioi (single nioi), and good Ko-Nuke (small ridges), and both the Jinuke and the blade are bright and clear.",
      "price": "2500000.00",
      "currency": "JPY",
      "created_at": "2025-11-01T14:36:32.346Z",
      "updated_at": "2025-11-04T01:33:08.265Z"
    }
  },
  {
    "model": "collection.collection",
    "pk": 9,
    "fields": {
      "name_jp": "政常（尾張徳川家伝来）",
      "name_en": "Masatsune (Handed down by the Owari Tokugawa family)",
      "provider": "E-Sword",
      "signature": "政常",
      "type": "katana",
      "blade_length": "69.60",
      "curvature": "1.20",
      "sword_weight": "576.00",
      "motohaba": "3.46",
      "sakihaba": "2.64",
      "motogasane": "0.85",
      "sakigasane": "0.55",
      "period_type": "shinto",
      "period": "Late Edo",
      "koshirae": "Shirasaya",
      "registration": "Saga No. 2818 April 23, 1951",
      "certificate": "Japan Art Sword Preservation Association, Preserved Sword Appraisal Certificate, April 12, 2011",
      "remarks": "The first Masatsune was the second son of the eighth generation of Seki Kanetsune of Mino Province, a swordsmith renowned for his mastery of spears and naginata. He began life under the name Kanetsune and moved to Kiyosu, Owari, where he became a swordsmith employed by Lord Fukushima Masanori, changed his name to Masatsune, and moved to Komaki. In 1582, he was awarded the title of Sagami no Kami.\r\nIn May 1585, he was given the title of Sagami no Kami.\r\nThe Masatsune name then flourished in Owari for ten generations, continuing until around the Keio era.\r\nThis sword has been handed down through the Owari Tokugawa family and was bestowed by a certain vassal. The inscription on the old white scabbard reads, \"I received this from your personal hand, on October 8th, 1869, in recognition of my efforts in national affairs at the Kyoto Art Museum in 1867. Respectfully written.\"\r\n\r\n*The old scabbard is inscribed with the following: \"I received this from His Majesty the Emperor himself in recognition of my efforts in national affairs at the Imperial Court in the 3rd year of the Keio era. Respectfully inscribed on October 8th, 1869.\"\r\n*This product also includes \"Famous Japanese Swords: Yuzankaku, co-authored by Shibata Mitsuo and Okochi Tsunehira.\"",
      "price": "1800000.00",
      "currency": "JPY",
      "created_at": "2025-11-01T14:31:58.609Z",
      "updated_at": "2025-11-04T01:33:23.543Z"
    }
  },
  {
    "model": "collection.collection",
    "pk": 8,
    "fields": {
      "name_jp": "無銘（畠田光守）",
      "name_en": "Mumei (Hatakeda Mitsumori)",
      "provider": "刀心",
      "signature": "無銘（畠田光守）",
      "type": "katana",
      "blade_length": "63.70",
      "curvature": "1.50",
      "sword_weight": "527.00",
      "motohaba": "2.61",
      "sakihaba": "2.09",
      "motogasane": "0.61",
      "sakigasane": "4.60",
      "period_type": "koto",
      "period": "Kamakura",
      "koshirae": "Black waxed scabbard with katana mounting",
      "registration": "Registered in Tokyo on November 21, 1995",
      "certificate": "Certificate from the Japanese Sword Preservation Society, Kurashiki Sword Museum",
      "remarks": "The Japanese Sword Preservation Society recognizes this sword as Yoshioka Ichimonji Sukemitsu. At the Kurashiki Sword Museum, this sword was perfected by Hatada Mitsumori.\r\n\r\nThe Yoshioka Ichimonji school was a school of swordsmiths who wielded their hammers in Yoshioka, Akaiwa District (present-day Kume District, Okayama Prefecture), on the left bank of the Yoshii River. Founded by Sukekichi, all members of the family have the character \"suke\" (suke) at the beginning of their swordsmith names. Sukemitsu is said to be the grandson or great-grandson of the founder, Sukekichi, and is a master swordsmith representing this school.\r\nSukemitsu's style is to forge blades with wide, chojiran or o-chojiran patterns with niodeki (a pattern where the entire blade is covered in niodeki), and the jigane has a fine mokumehada with ji-ni and a pronounced ranseki pattern.\r\nHe is known to have carved a long inscription reading \"1. Sakon no Shogen Ki Sukemitsu, resident of Yoshioka, Bizen Province,\" and to have used the surname Ki as the official title of Sakon no Shogen. His representative works include a naginata dating from 1822 and a tachi dating from 1822, both designated National Treasures.\r\n\r\nThe Hatada school was a school from Bizen Province (southeastern Okayama Prefecture) during the Kamakura period, and their style specialized in ornate clove-flared blade patterns, similar to the Osafune and Ichimonji schools of swordsmiths that flourished in the same region.\r\nMitsumori was a swordsmith of this school, and very few of his signature works remain. Among his representative works are the tachi handed down from the Hotta family, which is designated an Important Art Property, and the kodachi handed down from the Akimoto family, also designated an Important Art Property, bearing an inscription. Both of these swords display a magnificent style, with wide, nioi-style clove-flared patterns.\r\n\r\nAlthough this sword has been heavily polished, it still retains its firmness and slender yet elegant appearance. The jigane (base steel) is a mixture of small itame mokuji (small itame grain) and the hamon (blade pattern) has a soft, airy texture, with a mix of choji-irori (cross-grained) and kochoji (small cross-grained) patterns, koashi (small foot) and kinsuji (gold-striped) patterns, creating a myriad of variations. The nib is slightly irregular on the front and has a sharply rounded tip on the back, suggesting it is a sword that has survived actual combat, with eight notches, including small ones, visible on the ridge.",
      "price": "1210000.00",
      "currency": "JPY",
      "created_at": "2025-11-01T14:25:34.663Z",
      "updated_at": "2025-11-04T01:36:27.914Z"
    }
  },
  {
    "model": "collection.collection",
    "pk": 7,
    "fields": {
      "name_jp": "無銘（伝）兼長",
      "name_en": "Unsigned (attributed to Kanenaga)",
      "provider": "「刀の蔵」",
      "signature": "無銘（伝）兼長",
      "type": "tachi",
      "blade_length": "72.70",
      "curvature": "2.30",
      "sword_weight": "642.00",
      "motohaba": "3.14",
      "sakihaba": "2.24",
      "motogasane": "0.80",
      "sakigasane": "0.61",
      "period_type": "koto",
      "period": "Nanboku-chō",
      "koshirae": "Shirasaya",
      "registration": "Hokkaido registration: Issued on June 22, 2012",
      "certificate": "Important Sword (61st Important Sword Designation)",
      "remarks": "Kanenaga was a pupil of Osafune Nagayoshi, and although very few of his works still bear signatures, one of his works is a wakizashi from the 5th year of the Jōji era, designated an Important Art Object, which displays a pattern similar to that of a yaki-style sword. He also has two tanto swords, one from the 4th year of the Shitoku era, designated an Important Sword, and one from the 2nd year of the Kakei era, designated a Specially Important Sword. These two swords have stronger nigiri (boiling points) and more abundant jiba (ground edge) work, and are similar to Nagayoshi's style, but what is even more noteworthy is that they display a workmanship that emphasizes the Sagami tradition.\r\nThis work has a thick, fine nigiri (ground edge) workmanship on the itame forge, with frequent jikei (ground edge) workmanship and a faint, irregular pattern. The hamon (hamon) is complex, with a mix of various types of ha (blade) including ōgunome (mainly gunome) and chōji (clove), frequent ashi (foot) and ha (leaf) workmanship, good nigiri (boiling points), tobiyaki (flying fire) and sunagashi (sand flowing) workmanship, making it a sword rich in workmanship and variety within the blade.",
      "price": "4500000.00",
      "currency": "JPY",
      "created_at": "2025-11-01T14:17:41.221Z",
      "updated_at": "2025-11-04T01:35:54.341Z"
    }
  },
  {
    "model": "collection.collection",
    "pk": 6,
    "fields": {
      "name_jp": "大和守安定",
      "name_en": "Yamato No Kami Yasusada",
      "provider": "E-Sword",
      "signature": "大和守安定",
      "type": "katana",
      "blade_length": "71.10",
      "curvature": "0.90",
      "sword_weight": "632.00",
      "motohaba": "2.92",
      "sakihaba": "1.98",
      "motogasane": "0.67",
      "sakigasane": "0.47",
      "period_type": "shinto",
      "period": "Edo Keian",
      "koshirae": "Black stone-grain lacquered scabbard with three oak crests and scattered katana mounting",
      "registration": "Tokyo No. 7018587 March 31, 1961",
      "certificate": "Japan Art Sword Preservation Association Special Preservation Sword Appraisal Certificate June 28, 2",
      "remarks": "The first Yamatonokami Yasusada's home province was Echizen, and he is said to have been a disciple of the first Yamatonokami Yasutsugu, with recent research suggesting he was from the Kishu Ishido school.\r\nHe moved to Edo and lived in Kanda Shirogane-cho.\r\nYasusada's swords were known for their excellent sharpness, and many of them bear the test cutter names of swordsmiths such as Yamano Kaemon and Yamano Kanjuro.\r\nThey became extremely popular towards the end of the Edo period, and are known to have been the sword worn by Okita Soji, captain of the Shinsengumi's First Unit, and fellow unit member Oishi Kuwajiro.\r\nEven today, they remain popular as the epitome of a sharp, simple, and sturdy samurai sword.",
      "price": "1980000.00",
      "currency": "JPY",
      "created_at": "2025-11-01T14:10:24.736Z",
      "updated_at": "2025-11-04T01:35:33.424Z"
    }
  },
  {
    "model": "collection.collection",
    "pk": 5,
    "fields": {
      "name_jp": "助光（千手院）",
      "name_en": "Sukemitsu（Senjuin）",
      "provider": "刀心",
      "signature": "助光（千手院）",
      "type": "tachi",
      "blade_length": "63.40",
      "curvature": "2.11",
      "sword_weight": "583.00",
      "motohaba": "2.52",
      "sakihaba": "1.66",
      "motogasane": "0.67",
      "sakigasane": "0.50",
      "period_type": "koto",
      "period": "Kamakura",
      "koshirae": "Gold pear-ground nine-leaf bamboo leaf crest, scattered gold and silver shell makie scabbard, thread",
      "registration": "Registered in Tokyo on August 29, 1952",
      "certificate": "Special Preservation Sword Appraisal Certificate, Special Preservation Sword Accessories Appraisal C",
      "remarks": "According to the Meikan, the section on Yamato blacksmiths includes swordsmiths with names beginning with the character \"suke,\" such as Sukemitsu, Sukehira, Sukenobu, and Sukekichi, spanning the late Kamakura period to the late Muromachi period. There are very few surviving works bearing the inscription of Yamato Sukemitsu, but a tachi held by the Tokyo National Museum bears the handwritten inscription \"Sukemitsu, December 12th, Spring, Year 3 of Shoan,\" and other tachi swords designated as Specially Important Swords bear the two-character inscription \"Sukemitsu.\"\r\nThis kodachi is a rare surviving work bearing the inscription of Yamato Sukemitsu, and the large, powerful, angular calligraphy of the thick chisel is the same inscription as the aforementioned tachi, making it clear that it was made in the late Kamakura period.\r\n\r\nThis small sword, measuring just over two feet and one sun in length, features a firm, curved back, a densely forged koitame (small itame grain), pronounced irregular embossing, and ji-niwa (ground boiling). The hamon is straight with a koashi (small foot) pattern, a nioi (smell) pattern with ko-niwa (small boiling), prominent sand-flowing at the back, and a shallowly curved, small-rounded blade. At first glance, it resembles a Bizen Nagamitsu sword, except for the koshimoto (lower part). The file marks are sujigai (crossed edges) and the inscription is large.\r\n\r\nIt is odd that, despite its small size, the jiha (edge) is exceptionally fine, the irregular embossing, ko-choji (small cross-shaped edge), and the blade are Bizen-style. Is it a coincidence that there are swords in the Shosoin collection with a similar style? This is a topic for future research.\r\n\r\nThe above commentary is partially reprinted from the Japanese Sword Lecture Series. The ko-choji (small cross-shaped edge) designation is a combination of other Sukenamitsu styles.\r\n\r\nThe accompanying jin-tachi sword, with its tsurushi thread intact, is a masterpiece that has been passed down to the present day. Judging from the nine-leaf bamboo crest on the scabbard and metal fittings, it is speculated that this sword may have a connection to the Matsui family, lords of Yatsushiro Castle.\r\nThis sword is featured on page 211 of the Japanese Sword Lecture Series: Antique Sword Appraisal Volume 1.",
      "price": "5500000.00",
      "currency": "JPY",
      "created_at": "2025-11-01T14:03:16.497Z",
      "updated_at": "2025-11-04T01:39:31.792Z"
    }
  },
  {
    "model": "collection.collection",
    "pk": 4,
    "fields": {
      "name_jp": "左兵衛尉国光",
      "name_en": "Sahyoe no Jō Kunimitsu",
      "provider": "「刀の蔵」",
      "signature": "朱銘 左兵衛尉国光（粟田口）",
      "type": "katana",
      "blade_length": "74.80",
      "curvature": "1.20",
      "sword_weight": "748.00",
      "motohaba": "3.01",
      "sakihaba": "2.12",
      "motogasane": "0.66",
      "sakigasane": "0.52",
      "period_type": "koto",
      "period": "Mid-Kamakura",
      "koshirae": "Shirasaya",
      "registration": null,
      "certificate": "65th Important Sword Designation",
      "remarks": "Awataguchi Kunimitsu was a swordsmith said to be the son of Norikuni and the younger brother of Kuniyoshi. He was commonly known as Sahyoe no Jo. There are various theories about Kunimitsu's origins, including that he is identified with Shintogo Kunimitsu, the de facto founder of the Sagami school, or that he lived a very long life given the length of his active career, or that he was the son of Kuniyoshi rather than Norikuni, making him a mysterious swordsmith. Extant swords bearing his name are rare, and well-known examples include a sword bearing Sahyoe no Jo, a sword at Yoro-ji Temple in Gifu Prefecture, and a sword at the Kurokawa Institute for Ancient Culture (all designated Important Cultural Properties).\r\n\r\nHis style is in keeping with the Awataguchi tradition, and he specializes in slender, resilient swords with a Kyoto curve and an elegant appearance, as well as thin, straight blades with a ko-ni style.",
      "price": "15000000.00",
      "currency": "JPY",
      "created_at": "2025-11-01T13:54:53.113Z",
      "updated_at": "2025-11-04T01:35:09.298Z"
    }
  },
  {
    "model": "collection.collection",
    "pk": 3,
    "fields": {
      "name_jp": "備州長船祐定",
      "name_en": "Bishu Osafune Sukesda",
      "provider": "刀心",
      "signature": "備州長船祐定",
      "type": "katana",
      "blade_length": "65.85",
      "curvature": "2.10",
      "sword_weight": "682.00",
      "motohaba": "3.27",
      "sakihaba": "2.21",
      "motogasane": "0.75",
      "sakigasane": "0.55",
      "period_type": "koto",
      "period": "Muromachi",
      "koshirae": "Black stone-lacquered scabbard with tachi sword mountings",
      "registration": "Registered in Ehime Prefecture on January 21, 1952",
      "certificate": "Special Preservation Sword Appraisal Certificate",
      "remarks": "Along with Katsumitsu and Kiyomitsu, Sukesada is one of Bizen Osafune's leading swordsmiths of the late Muromachi period. Other masters include Yozaemon, Hikobei no Jo, Genbei, Genzaemon, Hikozaemon, and Gorozaemon, all of whom were renowned masters.\r\n\r\nThis sword retains its elegant form with a wide gap between the butt and tip, and has a curve from the waist up, known as a \"saki-kubori\" style. The jigane has well-forged mokume (grain) with a slight raised edge and jike (jikei) pattern. The hamon (hamon) has a curved, tanome-yaki pattern with a good depth, sand-flowing edge, and small cross-shaped patterns in places. The blade is irregular on both sides and has a rounded tip. While the secular name has not been cut, there are no notable forging marks and it is a sound sword.\r\n\r\nThe accompanying mounting is in good condition and undamaged. There is some rattle in the handle, but this can be easily fixed by rewinding the handle thread or adding a piece of wood. There is also very little rattle in the tsuba, which is preferable and does not require any compensation.\r\nThe mounting has also been appraised, making this a piece that we hope you will cherish for many years to come.",
      "price": "2310000.00",
      "currency": "JPY",
      "created_at": "2025-11-01T10:50:52.486Z",
      "updated_at": "2025-11-04T01:34:47.473Z"
    }
  },
  {
    "model": "collection.collection",
    "pk": 2,
    "fields": {
      "name_jp": "坂倉言之進照包 （越後守包貞二代）",
      "name_en": "Sakakura Gonnoshin Terukane  (2 generation echigo-no-kami kanesada)",
      "provider": "E-Sword",
      "signature": "坂倉言之進照包",
      "type": "katana",
      "blade_length": "63.30",
      "curvature": "0.90",
      "sword_weight": "513.00",
      "motohaba": "3.21",
      "sakihaba": "2.07",
      "motogasane": "0.66",
      "sakigasane": "0.51",
      "period_type": "shinto",
      "period": "Edo-ENPO",
      "koshirae": "Black lacquered scabbard with katana mounting",
      "registration": "Okayama No. 120305 February 22, 2006",
      "certificate": "Japan Art Sword Preservation Association Special Preservation Sword Appraisal Certificate May 8, 200",
      "remarks": "His home province was Mino and he was a member of the Terumon school, but he later moved to Osaka and became a pupil of Echigonokami Kanesada (1st), and his original signature was \"Settsu Goro Terukane.\"\r\nHe was adopted by Echigonokami Kanesada (1st), and around the Kanbun era he took the name Echigonokami Kanesada (2nd).\r\nHe later changed his name again around the Enpo era, returning to his original signature of Terukane, and changing the character \"teru\" to \"teru\" to make it Terukane, and he cuts swords with names such as \"Sakakura Kotonoshin Terukane\" and \"Sakakura Echigonokami Terukane.\"\r\nHis style, in the early Kanesada signatures, was largely Yamato-style, inherited from his teacher, while in the later Terukane signatures he excelled in the Sukehiro-style Toranha blade.",
      "price": "1400000.00",
      "currency": "JPY",
      "created_at": "2025-11-01T10:41:58.729Z",
      "updated_at": "2025-11-04T01:34:02.477Z"
    }
  },
  {
    "model": "collection.collection",
    "pk": 1,
    "fields": {
      "name_jp": "出羽守源光平造",
      "name_en": "Dewa no kami Genkoheizo",
      "provider": "「刀の蔵」",
      "signature": "出羽守源光平造",
      "type": "katana",
      "blade_length": "69.00",
      "curvature": "1.80",
      "sword_weight": "658.00",
      "motohaba": "3.16",
      "sakihaba": "2.23",
      "motogasane": "0.71",
      "sakigasane": "0.56",
      "period_type": "shinto",
      "period": "Early Edo",
      "koshirae": "Shirasaya",
      "registration": "Saga Prefecture, issued on May 10, 1972",
      "certificate": null,
      "remarks": "Hioki Kohei, along with Tsushimanokami Tsunemitsu, is renowned as a swordsmith representing the Edo Ishido school. He was born in Omi Province, and according to popular belief, he emigrated from Omi Province to Edo along with Tsushimanokami Tsunemitsu, Echizennokami Munehiro, and Ishido Koreichi. His style is characterized by the gorgeous clove-patterned pattern, which is reminiscent of the single-character pattern of ancient swords.\r\nThis sword has a small itame forged surface with fine ji-ne (ground boiling) that creates a faint, irregular shine. The blade features a varied clove-patterned pattern with small alternating patterns, frequent ashi and ha (leaf) patterns, and both the blade and the jibachi are bright and clear, making this an excellent piece.",
      "price": "1850000.00",
      "currency": "JPY",
      "created_at": "2025-11-01T10:32:07.427Z",
      "updated_at": "2025-11-04T01:33:46.318Z"
    }
  }
]