[
{
  "model": "others.section",
  "pk": 1,
  "fields": {
    "terms": 1,
    "sect": "Section",
    "sectno": "I",
    "sectname": "Parties to the Agreement",
    "sectdesc": "This contract is entered into between *Habaki , Ltd.*, a company duly incorporated and existing under the laws of Japan, with its principal office located at [Insert Address, Kyoto, Japan] (hereinafter referred to as the “Company”), and the Customer/Partner, whose details are specified in the order or agreement (hereinafter referred to as the “Client”)."
  }
},
{
  "model": "others.section",
  "pk": 2,
  "fields": {
    "terms": 1,
    "sect": "Section",
    "sectno": "II",
    "sectname": "Scope of Services",
    "sectdesc": "The Company agrees to manufacture, sell, and/or trade authentic Japanese katanas and related products, including custom-made swords, fittings, and restoration services, under the terms and conditions set forth herein."
  }
},
{
  "model": "others.section",
  "pk": 3,
  "fields": {
    "terms": 1,
    "sect": "Section",
    "sectno": "III",
    "sectname": "Territory",
    "sectdesc": "This contract applies to transactions and services provided both within Japan and internationally. The Company operates worldwide and complies with the legal requirements and export regulations of Japan and the Client’s country of residence."
  }
},
{
  "model": "others.section",
  "pk": 4,
  "fields": {
    "terms": 1,
    "sect": "Section",
    "sectno": "IV",
    "sectname": "Product Specifications and Customization",
    "sectdesc": "All products shall be made using traditional Japanese techniques and high-quality materials as described in the Company’s product catalog or custom order specifications.\r\nCustom orders will be manufactured according to the Client’s approved specifications.\r\nThe Company reserves the right to refuse any order that violates laws or ethical standards."
  }
},
{
  "model": "others.section",
  "pk": 9,
  "fields": {
    "terms": 1,
    "sect": "Section",
    "sectno": "IX",
    "sectname": "Intellectual Property",
    "sectdesc": "All trademarks, designs, and copyrights related to Habaki products remain the exclusive property of the Company.\r\nThe Client is granted a limited license to use the intellectual property solely for personal, non-commercial purposes."
  }
},
{
  "model": "others.section",
  "pk": 5,
  "fields": {
    "terms": 1,
    "sect": "Section",
    "sectno": "V",
    "sectname": "Pricing and Payment Terms",
    "sectdesc": "Prices are quoted in Japanese Yen (JPY) or the agreed currency and exclude applicable taxes, duties, and shipping fees unless otherwise stated.\r\nPayment terms will be specified in the invoice and may include advance payment, deposits, or full payment prior to shipment.\r\nThe Company accepts payment via bank transfer, credit card, or other agreed methods."
  }
},
{
  "model": "others.section",
  "pk": 6,
  "fields": {
    "terms": 1,
    "sect": "Section",
    "sectno": "VI",
    "sectname": "Delivery and Shipping",
    "sectdesc": "Delivery timelines will be communicated at the time of order confirmation but may vary due to the handcrafted nature of the products.\r\nShipping costs and responsibilities will be outlined separately and may depend on the destination country and shipping method.\r\nRisk of loss or damage passes to the Client upon delivery to the carrier."
  }
},
{
  "model": "others.section",
  "pk": 7,
  "fields": {
    "terms": 1,
    "sect": "Section",
    "sectno": "VII",
    "sectname": "Warranty and Liability",
    "sectdesc": "The Company guarantees the authenticity and craftsmanship of all katanas produced.\r\nWarranty covers manufacturing defects for a period of [e.g., 1 year] from delivery.\r\nThe Company is not liable for damage caused by misuse, improper maintenance, or accidents.\r\nLiability is limited to the replacement or repair of the product at the Company’s discretion."
  }
},
{
  "model": "others.section",
  "pk": 8,
  "fields": {
    "terms": 1,
    "sect": "Section",
    "sectno": "VIII",
    "sectname": "Returns and Refunds",
    "sectdesc": "Returns and refunds are subject to the Company’s refund policy, which distinguishes between custom and stock items.\r\nCustom orders are non-refundable once production begins."
  }
},
{
  "model": "others.section",
  "pk": 10,
  "fields": {
    "terms": 1,
    "sect": "Section",
    "sectno": "X",
    "sectname": "Confidentiality",
    "sectdesc": "Both parties agree to maintain confidentiality regarding any sensitive information exchanged during the course of this agreement."
  }
},
{
  "model": "others.section",
  "pk": 11,
  "fields": {
    "terms": 1,
    "sect": "Section",
    "sectno": "XI",
    "sectname": "Compliance with Laws",
    "sectdesc": "The Company complies with all applicable Japanese export laws and international trade regulations. The Client agrees to comply with their local laws regarding the import and ownership of swords."
  }
},
{
  "model": "others.section",
  "pk": 12,
  "fields": {
    "terms": 1,
    "sect": "Section",
    "sectno": "XII",
    "sectname": "Governing Law and Dispute Resolution",
    "sectdesc": "This contract shall be governed by the laws of Japan.\r\nAny disputes arising under this agreement shall be resolved through amicable negotiations.\r\nIf unresolved, disputes shall be submitted to the exclusive jurisdiction of the Tokyo District Court or an agreed arbitration body."
  }
},
{
  "model": "others.section",
  "pk": 13,
  "fields": {
    "terms": 1,
    "sect": "Section",
    "sectno": "XIII",
    "sectname": "Force Majeure",
    "sectdesc": "Neither party shall be liable for delays or failure in performance caused by circumstances beyond their reasonable control, including natural disasters, wars, or government restrictions."
  }
},
{
  "model": "others.section",
  "pk": 14,
  "fields": {
    "terms": 1,
    "sect": "Section",
    "sectno": "XIV",
    "sectname": "Entire Agreement",
    "sectdesc": "This document and any attached appendices constitute the entire agreement between the parties and supersede all prior communications or agreements."
  }
}
]
